БухЭксп/InformationRegisters/CW_ЗначенияЛогистическихСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияЛогистическихСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛогистическийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЛогистическиеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыЛогистическихСтатусов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonForms/CW_ЖурналГрузоперевозок_ОтборКонтейнеровПоТексту/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказатьНастройки = Ложь;
	Если Параметры.Свойство("ПоказатьНастройки") Тогда
		ПоказатьНастройки =	 Параметры.ПоказатьНастройки;
	Конецесли;
	
	Параметры.Свойство("ОбъектСсылка", ОбъектСсылка);
	
	Элементы.ГруппаПределыОтбора.Видимость = ЗначениеЗаполнено(ОбъектСсылка);
	
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Заявки") Тогда
		Элементы.НадписьПредупреждение.Заголовок = "ВНИМАНИЕ! Поиск выполняется в пределах заявки: ";
	Иначе
		Элементы.НадписьПредупреждение.Заголовок = "ВНИМАНИЕ! Поиск выполняется в пределах заказа: ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Элементы.ДеревоГПЗаказ.Видимость = ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Заявки");
	КонецЕсли;
	
	Элементы.Группа4.Видимость = ПоказатьНастройки; 
						
	ВосстановитьСеансовуюНастройку();
	
	УстановитьЗаголовкиЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиЭлементовФормы()
	
	Элементы.Количество_НомераКонтейнеров.Заголовок = ?(ТекстСодержитСписокНомеровКонтейнеров=0,"Найдено номеров контейнеров","Найдено представлений");
	
КонецПроцедуры

&НаКлиенте
Процедура кнПолучитьКонтейнера(Команда)
	
	Если ПустаяСтрока(Текст) Тогда
		_УФК.ВывестиПредупреждение("Введите текст");
		Возврат;
	КонецЕсли; 
	
	_ПолучитьКонтейнера();
	
КонецПроцедуры

&НаСервере
Процедура _ПолучитьКонтейнера()
	
	Список.Очистить();
	
	// закомментированный код вырезает из текста все буквы русского алфавита,
	// но в номерах контейнеров очень часто они присутствуют (по ошибке),
	// поэтому анализу подвергнем весь текст
	
	//ВыхТекст = "";
	//ДлТекста = СтрДлина(Текст);
	//Для Инк = 1 по ДлТекста цикл
	//	Если ЭтоЛатБуква(КодСимвола(Текст, Инк)) или ЭтоЦифра(КодСимвола(Текст, Инк)) Тогда
	//		ВыхТекст = ВыхТекст + Сред(Текст, Инк, 1);	
	//	КонецЕсли; 
	//КонецЦикла; 
	
	
	// посимвольно переберем весь текст и найдем в нем строки, похожие на номера контейнеров:
	// 4-й символ должен быть "U" (грузовой контейнер), первые 3 символа - буквы, 
	// с 5 - 11 - должны быть цифры 
	ВыхТекст = СокрЛП(Текст);
	ДлСтр = СтрДлина(ВыхТекст);
	
	
	Если ТекстСодержитСписокНомеровКонтейнеров = 0 Тогда
		МассивЗначений = Новый Массив;
	
		Для ВедСимв = 4 по ДлСтр-7 цикл
			Если Сред(ВыхТекст, ВедСимв, 1) = "U" ИЛИ Сред(ВыхТекст, ВедСимв, 1) = "u" тогда
				Если (ЭтоЛатБуква(КодСимвола(ВыхТекст, ВедСимв - 1)) или ЭтоРусБуква(КодСимвола(ВыхТекст, ВедСимв - 1))) и
					(ЭтоЛатБуква(КодСимвола(ВыхТекст, ВедСимв - 2)) или ЭтоРусБуква(КодСимвола(ВыхТекст, ВедСимв - 2))) и
					(ЭтоЛатБуква(КодСимвола(ВыхТекст, ВедСимв - 3)) или ЭтоРусБуква(КодСимвола(ВыхТекст, ВедСимв - 3))) 
					Тогда
					Если ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 1)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 2)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 3)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 4)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 5)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 6)) и
						ЭтоЦифра(КодСимвола(ВыхТекст, ВедСимв + 7)) 
						Тогда
						
						МассивЗначений.Добавить(ВРег(_СФ.стр_ЗаменитьСхожиеСимволыРусНаЛат(Сред(ВыхТекст, ВедСимв - 3, 11))));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
	Иначе
		времТекст = Текст;
		
		//Меняем разделители
		мСимволыДляЗамены = Новый массив;
		мСимволыДляЗамены.Добавить(",");
		мСимволыДляЗамены.Добавить(" ");
		мСимволыДляЗамены.Добавить("|");
		мСимволыДляЗамены.Добавить("/");
		мСимволыДляЗамены.Добавить("\");
		мСимволыДляЗамены.Добавить(Символы.ПС);
		
		Для Каждого СимволЗамены из мСимволыДляЗамены Цикл
			времТекст = СтрЗаменить(времТекст,СимволЗамены,";");
		КонецЦикла;
		
		МассивЗначений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(времТекст,";", Истина);
		
	КонецЕсли;
	
	Количество_НомераКонтейнеров 	= МассивЗначений.Количество();
	Количество_Грузоперевозки 		= 0;
	Количество_Отбор 				= 0;
	
	ДеревоГП.ПолучитьЭлементы().Очистить();
		
	Для Каждого ЗначениеМассива из МассивЗначений Цикл
		
		Нстр 					= ДеревоГП.ПолучитьЭлементы().Добавить();
		Нстр.НомерКонтейнера 	= ЗначениеМассива;
		Нстр.ЭтоГруппа 			= Истина;
		Нстр.Представление	 	= Нстр.НомерКонтейнера;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
		               |	CW_Грузоперевозки.ТипПеревозки КАК ТипПеревозки,
		               |	ЕСТЬNULL(CW_ЗначенияЛогистическихСтатусовОбъектов.ЛогистическийСтатус.СсылкаКартинки, """") КАК СсылкаКартинки
		               |ИЗ
		               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗначенияЛогистическихСтатусовОбъектов КАК CW_ЗначенияЛогистическихСтатусовОбъектов
		               |		ПО CW_Грузоперевозки.Ссылка = CW_ЗначенияЛогистическихСтатусовОбъектов.ОбъектСтатуса
		               |ГДЕ
		               |	CW_Грузоперевозки.CW_Представление ПОДОБНО ""%#СтрокаПоиска#%""
		               |	И НЕ CW_Грузоперевозки.ПометкаУдаления
					   |	//УсловиеПоЗаказуЗаявке";
		
		Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
			
			Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Заказы") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПоЗаказуЗаявке", "И CW_Грузоперевозки.Заказ = &ОбъектСсылка");	
			КонецЕсли;
			Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Заявки") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПоЗаказуЗаявке", "И CW_Грузоперевозки.Заявка = &ОбъектСсылка");	
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#СтрокаПоиска#", ЗначениеМассива);
		
		
		РезультатЗапроса 	=  Запрос.Выполнить();
		Выборка  			= РезультатЗапроса.Выбрать();
			
		Пока Выборка.Следующий() Цикл
			
			
			СтрокаГП = Нстр.ПолучитьЭлементы().Добавить();
			СтрокаГП.ЭтоГруппа = Ложь;
			СтрокаГП.Грузоперевозка = Выборка.Ссылка;
			СтрокаГП.ТипПеревозки 	= Выборка.ТипПеревозки;
			СтрокаГП.Представление = Строка(СтрокаГП.Грузоперевозка);
			СтрокаГП.ИндексКартинки = 3;
			СтрокаГП.Пометка = Истина;
			СтрокаГП.ЕстьГрузоперевозки = Истина;
			СтрокаГП.АдресКартинки 		= Выборка.СсылкаКартинки;
			
			_сф.Инкремент(Количество_Грузоперевозки);
			_сф.Инкремент(Количество_Отбор);
			
		КонецЦикла; 
	
		
		// --- 
		// анализируем найденные г/п и устанавливаем индекс картинки: красный - г/п не найдены, зелёный - г/п одна, синий - г/п несколько
		КоличествоНайденных = Нстр.ПолучитьЭлементы().Количество();
		Если (КоличествоНайденных = 0) Тогда
			
			Нстр.ИндексКартинки = 0;
			Нстр.ЕстьГрузоперевозки = Ложь;
			
		ИначеЕсли (КоличествоНайденных = 1) Тогда 
			
			
			Нстр.ИндексКартинки = 1;
			Нстр.Представление =  Нстр.НомерКонтейнера + " ("+Строка(КоличествоНайденных)+")";
			Нстр.ЕстьГрузоперевозки = Истина;
			
		Иначе
			
			Нстр.ИндексКартинки = 2;
			Нстр.Представление =  Нстр.НомерКонтейнера + " ("+Строка(КоличествоНайденных)+")";
			Нстр.ЕстьГрузоперевозки = Истина;
			
		КонецЕсли; 
		Нстр.АдресКартинки = "";
		
	КонецЦикла;

	// --- 
КонецПроцедуры
 

&НаСервере
Функция ЭтоЛатБуква(Код);
	
	//A - 65	Z - 90	a - 97	z - 122	
	Если (Код >= 65 и Код <= 90) ИЛИ (Код >= 97 и Код <= 122) Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли; 	
	
КонецФункции


// Выполняет проверку символа на принадлежность к русскому алфавиту
//
// Параметры
// ---------
//  <Код> (Число) - код символа в соответствии с кодировкой Unicode
//
// Возвращаемое значение
// ---------------------
//   <Истина> - символ принадлежит русскому алфавиту, <Ложь> - в противном случае
//
&НаСервере
Функция ЭтоРусБуква(Код);
	
	//A - 1040	Я - 1071	a - 1072	я - 1103	
	Если (Код >= 1040 и Код <= 1071) ИЛИ (Код >= 1072 и Код <= 1103) Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли; 	
	
КонецФункции

&НаСервере
Функция ЭтоЦифра(Код)
	
	//0 - 48	9 - 57
	Если Код >= 48 и Код <= 57 Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли; 	
	
КонецФункции

&НаКлиенте
Процедура кнОК(Команда)
	
	Если (ДеревоГП.ПолучитьЭлементы().Количество()=0) Тогда
		кнПолучитьКонтейнера(ЭтаФорма.Команды.Найти("кнПолучитьКонтейнера"));	
	КонецЕсли; 
	
	Рез =  _ПолучитьМассивГП();
	Если Рез.Количество() > 0 Тогда	
		
		Ответ = Новый Структура;
		Ответ.Вставить("НастройкиОтбора", Рез);
		Ответ.Вставить("УчестьОтбор", УчестьОтбор);
		Ответ.Вставить("УчестьСтатусы", УчестьСтатусы);
		ЭтаФорма.Закрыть(Ответ);
		
	Иначе
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПродолжения",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Контейнеры в тексте не найдены!" + Символы.ПС + "Продолжить редактирование?",  РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьМассивГП()
	// --- 
	
	Рез = Новый Массив;
	Для Каждого Стр из ДеревоГП.ПолучитьЭлементы() Цикл
		Для каждого СтрГП Из Стр.ПолучитьЭлементы() Цикл
			Если СтрГП.Пометка Тогда
				Рез.Добавить(СтрГП.Грузоперевозка);
			КонецЕсли;	
		КонецЦикла; 
	КонецЦикла;
	
	Возврат(Рез);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ОбработкаВопросаПродолжения(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура кнОтмена(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтбора(Команда)
	
	кнПолучитьКонтейнера(ЭтаФорма.Команды.Найти("кнПолучитьКонтейнера"));
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДеревоГПВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если (Поле.Имя = "ДеревоГППредставление") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьГрузоперевозку(Элементы.ДеревоГП.ТекущаяСтрока);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГППередНачаломИзменения(Элемент, Отказ)
	
	//Если (Элемент <> Элементы.ДеревоГППометка) Тогда
	//	
	//	Отказ = Истина;
	//	
	//	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрузоперевозку(Строка)
	// --- 
	
	СтрокаГП = ДеревоГП.НайтиПоИдентификатору(Строка);
	Если (НЕ СтрокаГП.ЭтоГруппа) Тогда
		ПоказатьЗначение(,СтрокаГП.Грузоперевозка);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура КомандаОткрытьГрузоперевозку(Команда)
	
	ОткрытьГрузоперевозку(Элементы.ДеревоГП.ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаУстановитьПометки(Команда)
	
	УстановитьЗначениеПометки(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСнятьПометки(Команда)
	
	УстановитьЗначениеПометки(Ложь);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПометки(Значение)
	// --- 
	
	Для каждого Стр Из ДеревоГП.ПолучитьЭлементы() Цикл
		
		Для каждого СтрГП Из Стр.ПолучитьЭлементы() Цикл
			
			СтрГП.Пометка = Значение;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Если (Значение) Тогда
		
		Количество_Отбор = Количество_Грузоперевозки;
		
	Иначе
		
		Количество_Отбор = 0;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ДеревоГППометкаПриИзменении(Элемент)
	
	Если (Элементы.ДеревоГП.ТекущиеДанные.Пометка) Тогда
		
		Количество_Отбор = Количество_Отбор + 1;
		
	Иначе
		
		Количество_Отбор = Количество_Отбор - 1;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаРазвернутьВсе(Команда)
	
	Для каждого Стр Из ДеревоГП.ПолучитьЭлементы() Цикл
		
		Элементы.ДеревоГП.Развернуть(Стр.ПолучитьИдентификатор(),Истина);
		
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСвернутьВсе(Команда)
	
	Для каждого Стр Из ДеревоГП.ПолучитьЭлементы() Цикл
		
		Элементы.ДеревоГП.Свернуть(Стр.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаУстановитьПометкуУПоследнейГрузоперевозки(Команда)
	
	УстановитьЗначениеПометки(Ложь);
	_КомандаУстановитьПометкуУПоследнейГрузоперевозки();
	
КонецПроцедуры

// Отмечает среди найденных гр
//
// Параметры:
// ----------
//  <Параметр1>  - <Тип.Вид> - описание параметра
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//
&НаСервере 
Процедура _КомандаУстановитьПометкуУПоследнейГрузоперевозки()
Перем ТЗ;	
	
	// таблица значений для сортировки грузоперевозок
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("КодГП");
	ТЗ.Колонки.Добавить("ДатаГП");
	ТЗ.Колонки.Добавить("ГП");
	
	// обход контейнеров
	Для каждого Стр Из ДеревоГП.ПолучитьЭлементы() Цикл
		
		// подготовим таблицу грузоперевозок для контейнера
		ТЗ.Очистить();
		Для каждого СтрГП Из Стр.ПолучитьЭлементы() Цикл
			НовСтр = ТЗ.Добавить();
			НовСтр.ГП = СтрГП.Грузоперевозка;
			НовСтр.КодГП = СтрГП.Грузоперевозка.Код;
			НовСтр.ДатаГП = СтрГП.Грузоперевозка.ДатаСделкиФ; 
		КонецЦикла; 
		
		// если для контейнера были найдены ГП, 
		// то найдем последнюю и поставим для нее флаг
		Если ТЗ.Количество() > 0 Тогда
			ТЗ.Сортировать("ДатаГП Убыв, КодГП Убыв");
			ТмпГП = ТЗ[0].ГП;
			
			// переберем грузоперевозки контейнера и поставим флаг на последней
			Для каждого СтрГП Из Стр.ПолучитьЭлементы() Цикл
				Если СтрГП.Грузоперевозка = ТмпГП Тогда
					СтрГП.Пометка = Истина;
					Количество_Отбор = Количество_Отбор + 1;
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; // для контейнера найдены ГП 
	КонецЦикла; // обход контейнеров

КонецПроцедуры // _КомандаУстановитьПометкуУПоследнейГрузоперевозки()

&НаКлиенте
Процедура ТекстСодержитСписокНомеровКонтейнеровПриИзменении(Элемент)
	
	ЭлементыДерева = ДеревоГП.ПолучитьЭлементы() ;
	
	Если ЭлементыДерева.количество() > 0 Тогда
		ДеревоГП.ПолучитьЭлементы().Очистить();
	Конецесли;
	
	Если Не ПустаяСтрока(Текст) Тогда
		кнПолучитьКонтейнера(ЭтаФорма.Команды.Найти("кнПолучитьКонтейнера"));
	Конецесли;
	
	УстановитьЗаголовкиЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриИзменении(Элемент)
	
	кнПолучитьКонтейнера(ЭтаФорма.Команды.Найти("кнПолучитьКонтейнера"));

КонецПроцедуры


&НаСервере
Процедура ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = "CW_ЖурналГрузоперевозок_ОтборКонтейнеровПоТексту";
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("ТекстСодержитСписокНомеровКонтейнеров",ТекстСодержитСписокНомеровКонтейнеров);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ТекстСодержитСписокНомеровКонтейнеров",ТекстСодержитСписокНомеровКонтейнеров);
	
	Идентификатор = "CW_ЖурналГрузоперевозок_ОтборКонтейнеровПоТексту";
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если не ЗавершениеРаботы Тогда
		СохранитьСеансовуюНастройку();
	КонецЕсли;
	
КонецПроцедуры
